embassy-rs/stm32-data-sources/cubeprogdb2/stm32c5/STMicroelectronics.stm32c5xx_dfp.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:stm32="https://developer.st.com/schemas/stm32cube/1.0.0" schemaVersion="1.7.55" xsi:noNamespaceSchemaLocation="PACK.xsd" xsi:schemaLocation="https://developer.st.com/schemas/stm32cube/1.0.0 stm32cube.xsd">
  <vendor>STMicroelectronics</vendor>
  <name>stm32c5xx_dfp</name>
  <description>STMicroelectronics STM32C5 Series Device Family Pack</description>
  <ECCN>
    <ECCN-EU>NEC</ECCN-EU>
    <ECCN-US>EAR99</ECCN-US>
  </ECCN>
  <environments>
    <environment name="STM32Cube">
      <stm32:pack type="DFP" friendlyName="stm32c5xx_dfp" shortDesc="STM32C5 Series Device Support">
        <relocation-info parent="" layer="" element=""/>
        <compatibility>
          <release version="2.0.0">
            <applicable-schema schemaType="clock" schemaVersion="1.0.0"/>
            <applicable-schema schemaType="peripherals" schemaVersion="1.6.0"/>
            <applicable-schema schemaType="DMA" schemaVersion="1.2.0"/>
            <applicable-schema schemaType="NVIC" schemaVersion="1.1.0"/>
            <applicable-schema schemaType="EXTI" schemaVersion="1.2.0"/>
            <applicable-schema schemaType="middlewares" schemaVersion="1.1.0"/>
            <applicable-schema schemaType="limitations" schemaVersion="1.1.0"/>
            <applicable-schema schemaType="pinout" schemaVersion="1.0.0"/>
            <applicable-schema schemaType="peripheral-configuration-mapping" schemaVersion="1.0.0"/>
            <applicable-schema schemaType="utilities" schemaVersion="1.1.0"/>
          </release>
        </compatibility>
      </stm32:pack>
    </environment>
  </environments>
  <url>https://developer.st.com/st-pack-server/api/v1/pack/</url>
  <repository>https://github.com/STMicroelectronics/stm32c5xx-dfp</repository>
  <license>LICENSE.md</license>
  <releases>
    <release version="2.0.0" date="2026-03-05">
      Supported Devices
      -----------------
        - STM32C551xx, STM32C552xx, STM32C562xx devices
        - STM32C531xx, STM32C532xx, STM32C542xx devices
        - STM32C591xx, STM32C593xx, STM32C5A3xx devices

      Supported Peripherals:
      ---------------------
        - System : CORTEX, CRS, DBGMCU, DMA, EXTI, FLASH, GPIO, ICACHE, IWDG, PWR, RAMCFG, RCC, SBS, WWDG
        - Analog : ADC, COMP, DAC, OPAMP
        - Timers : LPTIM, RTC, TIM
        - Connectivity : ETH, FDCAN, I2C, I3C, SMARTCARD, SMBUS, I2S, SPI, UART, LPUART, USART, USB, XSPI(DLYB)
        - Security : AES, HASH, RNG, PKA, CCB, TAMP
        - Computing : CORDIC, CRC
        - Power : PWR

      Development Toolchains and Compilers:
      ------------------------------------
        - IAR ARM Compiler V9
        - ARM Compiler 6
        - ARM GCC 13
    </release>
  </releases>
  <changelogs>
    <changelog id="Release Notes" name="Release_Notes.html"/>
  </changelogs>
  <keywords>
    <keyword>ST</keyword>
    <keyword>STMicroelectronics</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package</keyword>
    <keyword>STM32</keyword>
    <keyword>STM32C5</keyword>
    <keyword>STM32C5xx</keyword>
  </keywords>
  <devices>
    <family Dfamily="STM32C5 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M33" DcoreVersion="r0p4" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dtz="NO_TZ" Dendian="Little-endian" Dclock="144000000"/>
      <book name="https://www.st.com/resource/en/application_note/cd00167594-stm32-microcontroller-system-memory-boot-mode-stmicroelectronics.pdf" title="Introduction to system memory boot mode on STM32 MCUs"/>
      <book name="https://www.st.com/resource/en/programming_manual/pm0264-stm32-cortexm33-mcus-programming-manual-stmicroelectronics.pdf" title="STM32 Cortex-M33 MCUs and MPUs programming manual"/>
      <book name="https://www.st.com/resource/en/reference_manual/rm0522-stm32c5-series-armbased-32bit-mcus-stmicroelectronics.pdf" title="STM32C5 Arm-based 32-bit MCUs Reference Manual"/>
      <description>Most Cost effective Arm&amp;reg; Cortex&amp;reg;-M33 MCU</description>
      <feature type="Temp" n="-40" m="85"/>
      <environment name="STM32Cube">
        <stm32:device>
          <descriptors>
            <descriptor schemaType="peripheral-configuration-mapping" path="Descriptors/peripheral_configuration_mapping.json" schemaVersion="1.0.0" version="1.0.0"/>
          </descriptors>
        </stm32:device>
      </environment>
      <subFamily DsubFamily="STM32C53x/542">
        <memory name="SRAM" access="rwxn" start="0x20000000" size="0x10000" uninit="true" default="true"/>
        <book name="https://www.st.com/resource/en/errata_sheet/es0676-stm32c531xx-stm32c532xx-and-stm32c542xx-device-errata-stmicroelectronics.pdf" title="STM32C531xx, STM32C532xx, and STM32C542xx device Errata sheet"/>
        <feature type="ADC" name="ADCconverters (total)" n="0" m="12.16"/>
        <feature type="AnalogOther" name="comparator" n="2"/>
        <feature type="AnalogOther" name="op-amp" n="1"/>
        <feature type="I2C" name="I2C/Fast-mode Plus 12C (total)" n="2"/>
        <feature type="I2C" name="I2C" n="1"/>
        <feature type="Memory" name="RAM" n="65536"/>
        <feature type="SPI" n="2"/>
        <feature type="Timer" name="General Purpose Timers (total)" n="7" m="16.32"/>
        <feature type="Timer" name="General Purpose Timers" n="3" m="16"/>
        <feature type="Timer" name="General Purpose Timers" n="4" m="32"/>
        <feature type="TimerOther" name="RTC" n="1"/>
        <feature type="UART" name="UART" n="2"/>
        <feature type="USART" name="USART" n="2"/>
        <environment name="STM32Cube">
          <stm32:device>
            <descriptors>
              <descriptor schemaType="peripherals" path="Descriptors/peripherals/D44F_peripherals.json" schemaVersion="1.6.0" version="1.0.0"/>
              <descriptor schemaType="DMA" path="Descriptors/peripherals/D44F_DMA.json" schemaVersion="1.2.0" version="2.0.0"/>
              <descriptor schemaType="NVIC" path="Descriptors/peripherals/D44F_NVIC.json" schemaVersion="1.1.0" version="1.0.0"/>
              <descriptor schemaType="EXTI" path="Descriptors/peripherals/D44F_EXTI.json" schemaVersion="1.2.0" version="1.0.0"/>
              <descriptor schemaType="middlewares" path="Descriptors/middlewares/D44F_middlewares.json" schemaVersion="1.1.0" version="1.0.0"/>
              <descriptor schemaType="limitations" path="Descriptors/limitations/D44F_limitations.json" schemaVersion="1.1.0" version="2.0.0"/>
              <descriptor schemaType="utilities" path="Descriptors/utilities/D44F_utilities.json" schemaVersion="1.1.0" version="1.0.0"/>
            </descriptors>
          </stm32:device>
        </environment>
        <environment name="STM32CubeProgrammer">
          <idcode address="0xE0044000" id="0x44F" ap="1"/>
        </environment>
        <device Dname="STM32C531CB">
          <compile header="Include/stm32c5xx.h" define="STM32C531xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x20000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[34]x.xldr" start="0x08000000" size="0x20000" RAMstart="0x20000000" RAMsize="0x10000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c531cc.pdf" title="STM32C53xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="131072"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C531(C-K-R)(B-C)(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
              </descriptors>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C531.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="16" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C531CBT6">
            <feature type="QFP" name="LQFP48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C531CBTx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C531C(B-C)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
          <variant Dvariant="STM32C531CBU6">
            <feature type="QFN" name="UFQFPN48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C531CBUx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C531C(B-C)Ux_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
        </device>
        <device Dname="STM32C531CC">
          <compile header="Include/stm32c5xx.h" define="STM32C531xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x40000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[34]x.xldr" start="0x08000000" size="0x40000" RAMstart="0x20000000" RAMsize="0x10000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c531cc.pdf" title="STM32C53xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="262144"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C531(C-K-R)(B-C)(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
              </descriptors>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C531.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="32" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C531CCT6">
            <feature type="QFP" name="LQFP48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C531CCTx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C531C(B-C)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
          <variant Dvariant="STM32C531CCU6">
            <feature type="QFN" name="UFQFPN48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C531CCUx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C531C(B-C)Ux_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
        </device>
