embassy-rs/stm32-data-sources/cubeprogdb2/stm32c5/STMicroelectronics.stm32c5xx_dfp.pdsc
        <device Dname="STM32C531KC">
          <compile header="Include/stm32c5xx.h" define="STM32C531xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x40000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[34]x.xldr" start="0x08000000" size="0x40000" RAMstart="0x20000000" RAMsize="0x10000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c531cc.pdf" title="STM32C53xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="262144"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C531(C-K-R)(B-C)(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
              </descriptors>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C531.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="32" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C531KCT6">
            <feature type="QFP" name="LQFP32" n="32"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C531KCTx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C531K(B-C)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
          <variant Dvariant="STM32C531KCU6">
            <feature type="QFN" name="UFQFPN32" n="32"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C531KCUx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C531K(B-C)Ux_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
        </device>
        <device Dname="STM32C531RB">
          <compile header="Include/stm32c5xx.h" define="STM32C531xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x20000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[34]x.xldr" start="0x08000000" size="0x20000" RAMstart="0x20000000" RAMsize="0x10000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c531cc.pdf" title="STM32C53xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="131072"/>
          <feature type="QFP" name="LQFP64" n="64"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C531(C-K-R)(B-C)(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C531R(B-C)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C531RBTx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C531.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="16" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C531RBT6"/>
        </device>
        <device Dname="STM32C531RC">
          <compile header="Include/stm32c5xx.h" define="STM32C531xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x40000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[34]x.xldr" start="0x08000000" size="0x40000" RAMstart="0x20000000" RAMsize="0x10000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c531cc.pdf" title="STM32C53xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="262144"/>
          <feature type="QFP" name="LQFP64" n="64"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C531(C-K-R)(B-C)(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C531R(B-C)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C531RCTx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C531.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="32" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C531RCT6"/>
        </device>
        <device Dname="STM32C532CB">
          <compile header="Include/stm32c5xx.h" define="STM32C532xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x20000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[34]x.xldr" start="0x08000000" size="0x20000" RAMstart="0x20000000" RAMsize="0x10000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c531cc.pdf" title="STM32C53xxx Datasheet"/>
          <feature type="CAN" name="CAN FD" n="2"/>
          <feature type="Memory" name="Flash" n="131072"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C532(C-K-R)(B-C)(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
              </descriptors>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C532.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="16" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C532CBT6">
            <feature type="QFP" name="LQFP48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C532CBTx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(3-4)2C(B-C)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
          <variant Dvariant="STM32C532CBU6">
            <feature type="QFN" name="UFQFPN48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C532CBUx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(3-4)2C(B-C)Ux_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
        </device>
        <device Dname="STM32C532CC">
          <compile header="Include/stm32c5xx.h" define="STM32C532xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x40000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[34]x.xldr" start="0x08000000" size="0x40000" RAMstart="0x20000000" RAMsize="0x10000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c531cc.pdf" title="STM32C53xxx Datasheet"/>
          <feature type="CAN" name="CAN FD" n="2"/>
          <feature type="Memory" name="Flash" n="262144"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C532(C-K-R)(B-C)(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
              </descriptors>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C532.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="32" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C532CCT6">
            <feature type="QFP" name="LQFP48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C532CCTx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(3-4)2C(B-C)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
          <variant Dvariant="STM32C532CCU6">
            <feature type="QFN" name="UFQFPN48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C532CCUx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(3-4)2C(B-C)Ux_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
        </device>
