embassy-rs/stm32-data-sources/cubeprogdb2/stm32c5/STMicroelectronics.stm32c5xx_dfp.pdsc
        <device Dname="STM32C542KC">
          <compile header="Include/stm32c5xx.h" define="STM32C542xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x40000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[34]x.xldr" start="0x08000000" size="0x40000" RAMstart="0x20000000" RAMsize="0x10000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c542cc.pdf" title="STM32C542xx Datasheet"/>
          <feature type="CAN" name="CAN FD" n="2"/>
          <feature type="Crypto" name="AES"/>
          <feature type="Memory" name="Flash" n="262144"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C542(C-K-R)C(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
              </descriptors>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C542.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="32" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C542KCT6">
            <feature type="QFP" name="LQFP32" n="32"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C542KCTx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(3-4)2K(B-C)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
          <variant Dvariant="STM32C542KCU6">
            <feature type="QFN" name="UFQFPN32" n="32"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C542KCUx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(3-4)2K(B-C)Ux_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
        </device>
        <device Dname="STM32C542RC">
          <compile header="Include/stm32c5xx.h" define="STM32C542xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x40000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[34]x.xldr" start="0x08000000" size="0x40000" RAMstart="0x20000000" RAMsize="0x10000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c542cc.pdf" title="STM32C542xx Datasheet"/>
          <feature type="CAN" name="CAN FD" n="2"/>
          <feature type="Crypto" name="AES"/>
          <feature type="Memory" name="Flash" n="262144"/>
          <feature type="QFP" name="LQFP64" n="64"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C542(C-K-R)C(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(3-4)2R(B-C)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C542RCTx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C542.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="32" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C542RCT6"/>
        </device>
      </subFamily>
      <subFamily DsubFamily="STM32C55x/562">
        <memory name="SRAM" access="rwxn" start="0x20000000" size="0x20000" uninit="true" default="true"/>
        <book name="https://www.st.com/resource/en/errata_sheet/es0661-stm32c551xx552xx562xx-device-errata-stmicroelectronics.pdf" title="STM32C551xx/552xx/562xx device Errata sheet"/>
        <feature type="Memory" name="RAM" n="131072"/>
        <environment name="STM32Cube">
          <stm32:device>
            <descriptors>
              <descriptor schemaType="peripherals" path="Descriptors/peripherals/D44E_peripherals.json" schemaVersion="1.6.0" version="1.0.0"/>
              <descriptor schemaType="DMA" path="Descriptors/peripherals/D44E_DMA.json" schemaVersion="1.2.0" version="1.0.0"/>
              <descriptor schemaType="NVIC" path="Descriptors/peripherals/D44E_NVIC.json" schemaVersion="1.1.0" version="1.0.0"/>
              <descriptor schemaType="EXTI" path="Descriptors/peripherals/D44E_EXTI.json" schemaVersion="1.2.0" version="1.0.0"/>
              <descriptor schemaType="middlewares" path="Descriptors/middlewares/D44E_middlewares.json" schemaVersion="1.1.0" version="1.0.0"/>
              <descriptor schemaType="limitations" path="Descriptors/limitations/D44E_limitations.json" schemaVersion="1.1.0" version="1.0.0"/>
              <descriptor schemaType="utilities" path="Descriptors/utilities/D44E_utilities.json" schemaVersion="1.1.0" version="1.0.0"/>
            </descriptors>
          </stm32:device>
        </environment>
        <environment name="STM32CubeProgrammer">
          <idcode address="0xE0044000" id="0x44E" ap="1"/>
        </environment>
        <device Dname="STM32C551CC">
          <compile header="Include/stm32c5xx.h" define="STM32C551xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x40000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[56]x.xldr" start="0x08000000" size="0x40000" RAMstart="0x20000000" RAMsize="0x20000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c551cc.pdf" title="STM32C55xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="262144"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C551(C-K-M-R-V)(C-E)(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
              </descriptors>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C551.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="32" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C551CCT6">
            <feature type="QFP" name="LQFP48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C551CCTx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C551C(C-E)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
          <variant Dvariant="STM32C551CCU6">
            <feature type="QFN" name="UFQFPN48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C551CCUx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C551C(C-E)Ux_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
        </device>
