embassy-rs/stm32-data-sources/cubeprogdb2/stm32c5/STMicroelectronics.stm32c5xx_dfp.pdsc
        <device Dname="STM32C552CE">
          <compile header="Include/stm32c5xx.h" define="STM32C552xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x80000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[56]x.xldr" start="0x08000000" size="0x80000" RAMstart="0x20000000" RAMsize="0x20000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c551cc.pdf" title="STM32C55xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="524288"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C552(C-K-M-R-V)(C-E)(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
              </descriptors>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C552.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="64" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C552CET6">
            <feature type="QFP" name="LQFP48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C552CETx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(5-6)2C(C-E)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
          <variant Dvariant="STM32C552CEU6">
            <feature type="QFN" name="UFQFPN48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C552CEUx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(5-6)2C(C-E)Ux_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
        </device>
        <device Dname="STM32C552KC">
          <compile header="Include/stm32c5xx.h" define="STM32C552xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x40000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[56]x.xldr" start="0x08000000" size="0x40000" RAMstart="0x20000000" RAMsize="0x20000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c551cc.pdf" title="STM32C55xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="262144"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C552(C-K-M-R-V)(C-E)(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
              </descriptors>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C552.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="32" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C552KCT6">
            <feature type="QFP" name="LQFP32" n="32"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C552KCTx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(5-6)2K(C-E)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
          <variant Dvariant="STM32C552KCU6">
            <feature type="QFN" name="UFQFPN32" n="32"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C552KCUx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(5-6)2K(C-E)Ux_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
        </device>
        <device Dname="STM32C552KE">
          <compile header="Include/stm32c5xx.h" define="STM32C552xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x80000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[56]x.xldr" start="0x08000000" size="0x80000" RAMstart="0x20000000" RAMsize="0x20000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c551cc.pdf" title="STM32C55xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="524288"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C552(C-K-M-R-V)(C-E)(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
              </descriptors>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C552.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="64" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C552KET6">
            <feature type="QFP" name="LQFP32" n="32"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C552KETx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(5-6)2K(C-E)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
          <variant Dvariant="STM32C552KEU6">
            <feature type="QFN" name="UFQFPN32" n="32"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C552KEUx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(5-6)2K(C-E)Ux_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
        </device>
        <device Dname="STM32C552MC">
          <compile header="Include/stm32c5xx.h" define="STM32C552xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x40000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[56]x.xldr" start="0x08000000" size="0x40000" RAMstart="0x20000000" RAMsize="0x20000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c551cc.pdf" title="STM32C55xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="262144"/>
          <feature type="QFP" name="LQFP80" n="80"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C552(C-K-M-R-V)(C-E)(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(5-6)2M(C-E)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C552MCTx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C552.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="32" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C552MCT6"/>
        </device>
        <device Dname="STM32C552ME">
          <compile header="Include/stm32c5xx.h" define="STM32C552xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x80000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[56]x.xldr" start="0x08000000" size="0x80000" RAMstart="0x20000000" RAMsize="0x20000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c551cc.pdf" title="STM32C55xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="524288"/>
          <feature type="QFP" name="LQFP80" n="80"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C552(C-K-M-R-V)(C-E)(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(5-6)2M(C-E)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C552METx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C552.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="64" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C552MET6"/>
        </device>
