embassy-rs/stm32-data-sources/cubeprogdb2/stm32c5/STMicroelectronics.stm32c5xx_dfp.pdsc
        <device Dname="STM32C562RE">
          <compile header="Include/stm32c5xx.h" define="STM32C562xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x80000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[56]x.xldr" start="0x08000000" size="0x80000" RAMstart="0x20000000" RAMsize="0x20000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c562ce.pdf" title="STM32C562xx Datasheet"/>
          <feature type="Memory" name="Flash" n="524288"/>
          <feature type="QFP" name="LQFP64" n="64"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C562(C-K-M-R-V)E(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(5-6)2R(C-E)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C562RETx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C562.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="64" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C562RET6"/>
        </device>
        <device Dname="STM32C562VE">
          <compile header="Include/stm32c5xx.h" define="STM32C562xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x80000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[56]x.xldr" start="0x08000000" size="0x80000" RAMstart="0x20000000" RAMsize="0x20000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c562ce.pdf" title="STM32C562xx Datasheet"/>
          <feature type="Memory" name="Flash" n="524288"/>
          <feature type="QFP" name="LQFP100" n="100"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C562(C-K-M-R-V)E(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(5-6)2V(C-E)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C562VETx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C562.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="64" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C562VET6"/>
        </device>
      </subFamily>
      <subFamily DsubFamily="STM32C59x/5A3">
        <memory name="SRAM" access="rwxn" start="0x20000000" size="0x40000" uninit="true" default="true"/>
        <book name="https://www.st.com/resource/en/errata_sheet/es0677-stm32c5a3xg-stm32c593xx-and-stm32c591xx-device-errata-stmicroelectronics.pdf" title="STM32C5A3xG, STM32C593xx, and STM32C591xx device Errata sheet"/>
        <feature type="ADC" name="ADCconverters (total)" n="0" m="12.16"/>
        <feature type="AnalogOther" name="comparator" n="1"/>
        <feature type="I2C" name="I2C/Fast-mode Plus 12C (total)" n="3"/>
        <feature type="I2C" name="I2C" n="2"/>
        <feature type="I2S" name="I2S" n="2"/>
        <feature type="Memory" name="RAM" n="262144"/>
        <feature type="SPI" n="3"/>
        <feature type="Timer" name="General Purpose Timers (total)" n="11" m="16.32"/>
        <feature type="Timer" name="General Purpose Timers" n="5" m="32"/>
        <feature type="Timer" name="General Purpose Timers" n="6" m="16"/>
        <feature type="TimerOther" name="RTC" n="1"/>
        <feature type="UART" name="UART" n="3"/>
        <feature type="USART" name="USART" n="4"/>
        <environment name="STM32Cube">
          <stm32:device>
            <descriptors>
              <descriptor schemaType="peripherals" path="Descriptors/peripherals/D45A_peripherals.json" schemaVersion="1.6.0" version="1.0.0"/>
              <descriptor schemaType="DMA" path="Descriptors/peripherals/D45A_DMA.json" schemaVersion="1.2.0" version="1.0.0"/>
              <descriptor schemaType="NVIC" path="Descriptors/peripherals/D45A_NVIC.json" schemaVersion="1.1.0" version="1.0.0"/>
              <descriptor schemaType="EXTI" path="Descriptors/peripherals/D45A_EXTI.json" schemaVersion="1.2.0" version="1.0.0"/>
              <descriptor schemaType="middlewares" path="Descriptors/middlewares/D45A_middlewares.json" schemaVersion="1.1.0" version="1.0.0"/>
              <descriptor schemaType="limitations" path="Descriptors/limitations/D45A_limitations.json" schemaVersion="1.1.0" version="2.0.0"/>
              <descriptor schemaType="utilities" path="Descriptors/utilities/D45A_utilities.json" schemaVersion="1.1.0" version="1.0.0"/>
            </descriptors>
          </stm32:device>
        </environment>
        <environment name="STM32CubeProgrammer">
          <idcode address="0xE0044000" id="0x45A" ap="1"/>
        </environment>
        <device Dname="STM32C591CE">
          <compile header="Include/stm32c5xx.h" define="STM32C591xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x80000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x80000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c591zg.pdf" title="STM32C59xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="524288"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C591C(E-G)(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
              </descriptors>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C591.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="64" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C591CET6">
            <feature type="QFP" name="LQFP48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C591CETx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C591C(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
          <variant Dvariant="STM32C591CEU6">
            <feature type="QFN" name="UFQFPN48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C591CEUx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C591C(E-G)Ux_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
        </device>
        <device Dname="STM32C591CG">
          <compile header="Include/stm32c5xx.h" define="STM32C591xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x100000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x100000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c591zg.pdf" title="STM32C59xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="1048576"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C591C(E-G)(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
              </descriptors>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C591.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="128" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C591CGT6">
            <feature type="QFP" name="LQFP48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C591CGTx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C591C(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
          <variant Dvariant="STM32C591CGU6">
            <feature type="QFN" name="UFQFPN48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C591CGUx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C591C(E-G)Ux_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
        </device>
