embassy-rs/stm32-data-sources/cubeprogdb2/stm32c5/STMicroelectronics.stm32c5xx_dfp.pdsc
        <device Dname="STM32C591KE">
          <compile header="Include/stm32c5xx.h" define="STM32C591xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x80000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x80000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c591zg.pdf" title="STM32C59xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="524288"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C591K(E-G)(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
              </descriptors>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C591.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="64" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C591KET6">
            <feature type="QFP" name="LQFP32" n="32"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C591KETx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C591K(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="2.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
          <variant Dvariant="STM32C591KEU6">
            <feature type="QFN" name="UFQFPN32" n="32"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C591KEUx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C591K(E-G)Ux_pinout.json" schemaVersion="1.0.0" version="2.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
        </device>
        <device Dname="STM32C591KG">
          <compile header="Include/stm32c5xx.h" define="STM32C591xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x100000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x100000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c591zg.pdf" title="STM32C59xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="1048576"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C591K(E-G)(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
              </descriptors>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C591.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="128" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C591KGT6">
            <feature type="QFP" name="LQFP32" n="32"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C591KGTx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C591K(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="2.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
          <variant Dvariant="STM32C591KGU6">
            <feature type="QFN" name="UFQFPN32" n="32"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C591KGUx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C591K(E-G)Ux_pinout.json" schemaVersion="1.0.0" version="2.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
        </device>
        <device Dname="STM32C591ME">
          <compile header="Include/stm32c5xx.h" define="STM32C591xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x80000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x80000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c591zg.pdf" title="STM32C59xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="524288"/>
          <feature type="QFP" name="LQFP80" n="80"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C591(M-R-V-Z)(E-G)Tx_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C591M(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C591METx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C591.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="64" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C591MET6"/>
        </device>
        <device Dname="STM32C591MG">
          <compile header="Include/stm32c5xx.h" define="STM32C591xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x100000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x100000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c591zg.pdf" title="STM32C59xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="1048576"/>
          <feature type="QFP" name="LQFP80" n="80"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C591(M-R-V-Z)(E-G)Tx_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C591M(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C591MGTx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C591.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="128" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C591MGT6"/>
        </device>
        <device Dname="STM32C591RE">
          <compile header="Include/stm32c5xx.h" define="STM32C591xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x80000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x80000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c591zg.pdf" title="STM32C59xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="524288"/>
          <feature type="QFP" name="LQFP64" n="64"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C591(M-R-V-Z)(E-G)Tx_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C591R(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C591RETx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C591.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="64" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C591RET6"/>
        </device>
        <device Dname="STM32C591RG">
          <compile header="Include/stm32c5xx.h" define="STM32C591xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x100000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x100000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c591zg.pdf" title="STM32C59xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="1048576"/>
          <feature type="QFP" name="LQFP64" n="64"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C591(M-R-V-Z)(E-G)Tx_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C591R(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C591RGTx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C591.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="128" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C591RGT6"/>
        </device>
        <device Dname="STM32C591VE">
          <compile header="Include/stm32c5xx.h" define="STM32C591xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x80000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x80000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c591zg.pdf" title="STM32C59xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="524288"/>
          <feature type="QFP" name="LQFP100" n="100"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C591(M-R-V-Z)(E-G)Tx_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C591V(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C591VETx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C591.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="64" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C591VET6"/>
        </device>
