embassy-rs/stm32-data-sources/cubeprogdb2/stm32c5/STMicroelectronics.stm32c5xx_dfp.pdsc
        <device Dname="STM32C591VG">
          <compile header="Include/stm32c5xx.h" define="STM32C591xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x100000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x100000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c591zg.pdf" title="STM32C59xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="1048576"/>
          <feature type="QFP" name="LQFP100" n="100"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C591(M-R-V-Z)(E-G)Tx_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C591V(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C591VGTx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C591.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="128" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C591VGT6"/>
        </device>
        <device Dname="STM32C591ZE">
          <compile header="Include/stm32c5xx.h" define="STM32C591xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x80000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x80000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c591zg.pdf" title="STM32C59xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="524288"/>
          <feature type="QFP" name="LQFP144" n="144"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C591(M-R-V-Z)(E-G)Tx_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C591Z(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C591ZETx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C591.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="64" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C591ZET6"/>
        </device>
        <device Dname="STM32C591ZG">
          <compile header="Include/stm32c5xx.h" define="STM32C591xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x100000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x100000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c591zg.pdf" title="STM32C59xxx Datasheet"/>
          <feature type="Memory" name="Flash" n="1048576"/>
          <feature type="QFP" name="LQFP144" n="144"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C591(M-R-V-Z)(E-G)Tx_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C591Z(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C591ZGTx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C591.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="128" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C591ZGT6"/>
        </device>
        <device Dname="STM32C593CE">
          <compile header="Include/stm32c5xx.h" define="STM32C593xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x80000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x80000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <feature type="CAN" name="CAN FD" n="2"/>
          <feature type="Memory" name="Flash" n="524288"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C593C(E-G)(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
              </descriptors>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C593.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="64" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C593CET6">
            <feature type="QFP" name="LQFP48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C593CETx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(9-A)3C(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="2.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
          <variant Dvariant="STM32C593CEU6">
            <feature type="QFN" name="UFQFPN48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C593CEUx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(9-A)3C(E-G)Ux_pinout.json" schemaVersion="1.0.0" version="2.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
        </device>
        <device Dname="STM32C593CG">
          <compile header="Include/stm32c5xx.h" define="STM32C593xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x100000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x100000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <feature type="CAN" name="CAN FD" n="2"/>
          <feature type="Memory" name="Flash" n="1048576"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C593C(E-G)(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
              </descriptors>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C593.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="128" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C593CGT6">
            <feature type="QFP" name="LQFP48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C593CGTx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(9-A)3C(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="2.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
          <variant Dvariant="STM32C593CGU6">
            <feature type="QFN" name="UFQFPN48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C593CGUx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(9-A)3C(E-G)Ux_pinout.json" schemaVersion="1.0.0" version="2.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
        </device>
