embassy-rs/stm32-data-sources/cubeprogdb2/stm32c5/STMicroelectronics.stm32c5xx_dfp.pdsc
        <device Dname="STM32C593VG">
          <compile header="Include/stm32c5xx.h" define="STM32C593xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x100000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x100000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <feature type="CAN" name="CAN FD" n="2"/>
          <feature type="Memory" name="Flash" n="1048576"/>
          <feature type="QFP" name="LQFP100" n="100"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C593(M-R-V-Z)(E-G)Tx_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(9-A)3V(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C593VGTx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C593.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="128" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C593VGT6"/>
        </device>
        <device Dname="STM32C593ZE">
          <compile header="Include/stm32c5xx.h" define="STM32C593xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x80000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x80000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <feature type="CAN" name="CAN FD" n="2"/>
          <feature type="Memory" name="Flash" n="524288"/>
          <feature type="QFP" name="LQFP144" n="144"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C593(M-R-V-Z)(E-G)Tx_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(9-A)3Z(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C593ZETx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C593.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="64" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C593ZET6"/>
        </device>
        <device Dname="STM32C593ZG">
          <compile header="Include/stm32c5xx.h" define="STM32C593xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x100000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x100000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <feature type="CAN" name="CAN FD" n="2"/>
          <feature type="Memory" name="Flash" n="1048576"/>
          <feature type="QFP" name="LQFP144" n="144"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C593(M-R-V-Z)(E-G)Tx_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(9-A)3Z(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C593ZGTx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C593.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="128" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C593ZGT6"/>
        </device>
        <device Dname="STM32C5A3CG">
          <compile header="Include/stm32c5xx.h" define="STM32C5A3xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x100000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x100000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c5a3cg.pdf" title="STM32C5Axxx Datasheet"/>
          <feature type="CAN" name="CAN FD" n="2"/>
          <feature type="Crypto" name="AES"/>
          <feature type="Crypto" name="S-AES"/>
          <feature type="Memory" name="Flash" n="1048576"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C5A3CG(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
              </descriptors>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C5A3.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="128" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C5A3CGT6">
            <feature type="QFP" name="LQFP48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C5A3CGTx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(9-A)3C(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="2.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
          <variant Dvariant="STM32C5A3CGU6">
            <feature type="QFN" name="UFQFPN48" n="48"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C5A3CGUx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(9-A)3C(E-G)Ux_pinout.json" schemaVersion="1.0.0" version="2.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
        </device>
        <device Dname="STM32C5A3KG">
          <compile header="Include/stm32c5xx.h" define="STM32C5A3xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x100000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x100000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c5a3cg.pdf" title="STM32C5Axxx Datasheet"/>
          <feature type="CAN" name="CAN FD" n="2"/>
          <feature type="Crypto" name="AES"/>
          <feature type="Crypto" name="S-AES"/>
          <feature type="Memory" name="Flash" n="1048576"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C5A3KG(T-U)x_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
              </descriptors>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C5A3.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="128" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C5A3KGT6">
            <feature type="QFP" name="LQFP32" n="32"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C5A3KGTx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(9-A)3K(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="2.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
          <variant Dvariant="STM32C5A3KGU6">
            <feature type="QFN" name="UFQFPN32" n="32"/>
            <environment name="STM32Cube">
              <stm32:device>
                <extra-attributes>
                  <extra-attribute name="PPN" value="STM32C5A3KGUx"/>
                </extra-attributes>
                <descriptors>
                  <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(9-A)3K(E-G)Ux_pinout.json" schemaVersion="1.0.0" version="2.0.0"/>
                </descriptors>
              </stm32:device>
            </environment>
          </variant>
        </device>
        <device Dname="STM32C5A3MG">
          <compile header="Include/stm32c5xx.h" define="STM32C5A3xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x100000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x100000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c5a3cg.pdf" title="STM32C5Axxx Datasheet"/>
          <feature type="CAN" name="CAN FD" n="2"/>
          <feature type="Crypto" name="AES"/>
          <feature type="Crypto" name="S-AES"/>
          <feature type="Memory" name="Flash" n="1048576"/>
          <feature type="QFP" name="LQFP80" n="80"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C5A3(M-R-V-Z)GTx_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(9-A)3M(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C5A3MGTx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C5A3.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="128" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C5A3MGT6"/>
        </device>
        <device Dname="STM32C5A3RG">
          <compile header="Include/stm32c5xx.h" define="STM32C5A3xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x100000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x100000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c5a3cg.pdf" title="STM32C5Axxx Datasheet"/>
          <feature type="CAN" name="CAN FD" n="2"/>
          <feature type="Crypto" name="AES"/>
          <feature type="Crypto" name="S-AES"/>
          <feature type="Memory" name="Flash" n="1048576"/>
          <feature type="QFP" name="LQFP64" n="64"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C5A3(M-R-V-Z)GTx_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(9-A)3R(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C5A3RGTx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C5A3.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="128" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C5A3RGT6"/>
        </device>
