embassy-rs/stm32-data-sources/cubeprogdb2/stm32c5/STMicroelectronics.stm32c5xx_dfp.pdsc
        <device Dname="STM32C5A3VG">
          <compile header="Include/stm32c5xx.h" define="STM32C5A3xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x100000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x100000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c5a3cg.pdf" title="STM32C5Axxx Datasheet"/>
          <feature type="CAN" name="CAN FD" n="2"/>
          <feature type="Crypto" name="AES"/>
          <feature type="Crypto" name="S-AES"/>
          <feature type="Memory" name="Flash" n="1048576"/>
          <feature type="QFP" name="LQFP100" n="100"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C5A3(M-R-V-Z)GTx_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(9-A)3V(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C5A3VGTx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C5A3.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="128" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C5A3VGT6"/>
        </device>
        <device Dname="STM32C5A3ZG">
          <compile header="Include/stm32c5xx.h" define="STM32C5A3xx"/>
          <memory name="FLASH" access="rxn" start="0x08000000" size="0x100000" default="true" startup="true"/>
          <algorithm name="Flash/STM32C5[9A]x.xldr" start="0x08000000" size="0x100000" RAMstart="0x20000000" RAMsize="0x40000" default="1"/>
          <book name="https://www.st.com/resource/en/datasheet/stm32c5a3cg.pdf" title="STM32C5Axxx Datasheet"/>
          <feature type="CAN" name="CAN FD" n="2"/>
          <feature type="Crypto" name="AES"/>
          <feature type="Crypto" name="S-AES"/>
          <feature type="Memory" name="Flash" n="1048576"/>
          <feature type="QFP" name="LQFP144" n="144"/>
          <environment name="STM32Cube">
            <stm32:device>
              <descriptors>
                <descriptor schemaType="clock" path="Descriptors/clock/STM32C5A3(M-R-V-Z)GTx_clock.json" schemaVersion="1.0.0" version="2.0.0"/>
                <descriptor schemaType="pinout" path="Descriptors/pinout/STM32C5(9-A)3Z(E-G)Tx_pinout.json" schemaVersion="1.0.0" version="1.0.0"/>
              </descriptors>
              <extra-attributes>
                <extra-attribute name="PPN" value="STM32C5A3ZGTx"/>
              </extra-attributes>
            </stm32:device>
          </environment>
          <debug svd="SVD/STM32C5A3.svd" __ap="1"/>
          <flashinfo name="FLASH" start="0x08000000" pagesize="16">
            <block count="128" size="0x2000"/>
          </flashinfo>
          <variant Dvariant="STM32C5A3ZGT6"/>
        </device>
      </subFamily>
    </family>
  </devices>
  <components>
    <component Cclass="Device" Cgroup="Startup" isDefaultVariant="true" condition="STM32C5" Cversion="2.0.0">
      <description>System Startup for STMicroelectronics STM32C5 Series</description>
      <RTE_Components_h>#define RTE_DEVICE_STARTUP_STM32C5XX    /* Device Startup for STM32C5 */</RTE_Components_h>
      <files>
        <file name="Include/" category="include" version="2.0.0"/>
        <file name="Include/Templates/stm32_external_env.h" category="header" attr="template" version="2.0.0" select="External Environment Values Template"/>
        <file name="Include/stm32c5xx.h" category="header" version="2.0.0"/>
        <file name="README.md" category="doc" version="2.0.0"/>
        <file name="Source/Templates/arm/linker/stm32c53xxb_flash.sct" category="linkerScript" attr="config" condition="STM32C53xxB ARMCC" version="2.0.0"/>
        <file name="Source/Templates/arm/linker/stm32c53xxc_flash.sct" category="linkerScript" attr="config" condition="STM32C53xxC ARMCC" version="2.0.0"/>
        <file name="Source/Templates/arm/linker/stm32c542xc_flash.sct" category="linkerScript" attr="config" condition="STM32C542xC ARMCC" version="2.0.0"/>
        <file name="Source/Templates/arm/linker/stm32c55xxc_flash.sct" category="linkerScript" attr="config" condition="STM32C55xxC ARMCC" version="2.0.0"/>
        <file name="Source/Templates/arm/linker/stm32c55xxe_flash.sct" category="linkerScript" attr="config" condition="STM32C55xxE ARMCC" version="2.0.0"/>
        <file name="Source/Templates/arm/linker/stm32c562xe_flash.sct" category="linkerScript" attr="config" condition="STM32C562xE ARMCC" version="2.0.0"/>
        <file name="Source/Templates/arm/linker/stm32c59xxe_flash.sct" category="linkerScript" attr="config" condition="STM32C59xxE ARMCC" version="2.0.0"/>
        <file name="Source/Templates/arm/linker/stm32c59xxg_flash.sct" category="linkerScript" attr="config" condition="STM32C59xxG ARMCC" version="2.0.0"/>
        <file name="Source/Templates/arm/linker/stm32c5a3xg_flash.sct" category="linkerScript" attr="config" condition="STM32C5A3xG ARMCC" version="2.0.0"/>
        <file name="Source/Templates/gcc/linker/stm32c53xxb_flash.ld" category="linkerScript" attr="config" condition="STM32C53xxB GCC" version="2.0.0"/>
        <file name="Source/Templates/gcc/linker/stm32c53xxc_flash.ld" category="linkerScript" attr="config" condition="STM32C53xxC GCC" version="2.0.0"/>
        <file name="Source/Templates/gcc/linker/stm32c542xc_flash.ld" category="linkerScript" attr="config" condition="STM32C542xC GCC" version="2.0.0"/>
        <file name="Source/Templates/gcc/linker/stm32c55xxc_flash.ld" category="linkerScript" attr="config" condition="STM32C55xxC GCC" version="2.0.0"/>
        <file name="Source/Templates/gcc/linker/stm32c55xxe_flash.ld" category="linkerScript" attr="config" condition="STM32C55xxE GCC" version="2.0.0"/>
        <file name="Source/Templates/gcc/linker/stm32c562xe_flash.ld" category="linkerScript" attr="config" condition="STM32C562xE GCC" version="2.0.0"/>
        <file name="Source/Templates/gcc/linker/stm32c59xxe_flash.ld" category="linkerScript" attr="config" condition="STM32C59xxE GCC" version="2.0.0"/>
        <file name="Source/Templates/gcc/linker/stm32c59xxg_flash.ld" category="linkerScript" attr="config" condition="STM32C59xxG GCC" version="2.0.0"/>
        <file name="Source/Templates/gcc/linker/stm32c5a3xg_flash.ld" category="linkerScript" attr="config" condition="STM32C5A3xG GCC" version="2.0.0"/>
        <file name="Source/Templates/iar/linker/stm32c53xxb_flash.icf" category="linkerScript" attr="config" condition="STM32C53xxB IAR" version="2.0.0"/>
        <file name="Source/Templates/iar/linker/stm32c53xxc_flash.icf" category="linkerScript" attr="config" condition="STM32C53xxC IAR" version="2.0.0"/>
        <file name="Source/Templates/iar/linker/stm32c542xc_flash.icf" category="linkerScript" attr="config" condition="STM32C542xC IAR" version="2.0.0"/>
        <file name="Source/Templates/iar/linker/stm32c55xxc_flash.icf" category="linkerScript" attr="config" condition="STM32C55xxC IAR" version="2.0.0"/>
        <file name="Source/Templates/iar/linker/stm32c55xxe_flash.icf" category="linkerScript" attr="config" condition="STM32C55xxE IAR" version="2.0.0"/>
        <file name="Source/Templates/iar/linker/stm32c562xe_flash.icf" category="linkerScript" attr="config" condition="STM32C562xE IAR" version="2.0.0"/>
        <file name="Source/Templates/iar/linker/stm32c59xxe_flash.icf" category="linkerScript" attr="config" condition="STM32C59xxE IAR" version="2.0.0"/>
        <file name="Source/Templates/iar/linker/stm32c59xxg_flash.icf" category="linkerScript" attr="config" condition="STM32C59xxG IAR" version="2.0.0"/>
        <file name="Source/Templates/iar/linker/stm32c5a3xg_flash.icf" category="linkerScript" attr="config" condition="STM32C5A3xG IAR" version="2.0.0"/>
        <file name="Source/Templates/system_stm32c5xx.c" category="source" attr="config" version="2.0.0"/>
        <file name="Source/startup_stm32c531xx.c" category="source" attr="config" condition="STM32C531" version="2.0.0"/>
        <file name="Source/startup_stm32c532xx.c" category="source" attr="config" condition="STM32C532" version="2.0.0"/>
        <file name="Source/startup_stm32c542xx.c" category="source" attr="config" condition="STM32C542" version="2.0.0"/>
        <file name="Source/startup_stm32c551xx.c" category="source" attr="config" condition="STM32C551" version="2.0.0"/>
        <file name="Source/startup_stm32c552xx.c" category="source" attr="config" condition="STM32C552" version="2.0.0"/>
        <file name="Source/startup_stm32c562xx.c" category="source" attr="config" condition="STM32C562" version="2.0.0"/>
        <file name="Source/startup_stm32c591xx.c" category="source" attr="config" condition="STM32C591" version="2.0.0"/>
        <file name="Source/startup_stm32c593xx.c" category="source" attr="config" condition="STM32C593" version="2.0.0"/>
        <file name="Source/startup_stm32c5a3xx.c" category="source" attr="config" condition="STM32C5A3" version="2.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Cvariant="SRAM" condition="STM32C5" Cversion="2.0.0">
      <description>System Startup for STMicroelectronics STM32C5 Series</description>
      <RTE_Components_h>#define RTE_DEVICE_STARTUP_STM32C5XX    /* Device Startup for STM32C5 */</RTE_Components_h>
      <files>
        <file name="Include/" category="include" version="2.0.0"/>
        <file name="Include/Templates/stm32_external_env.h" category="header" attr="template" version="2.0.0" select="External Environment Values Template"/>
        <file name="Include/stm32c5xx.h" category="header" version="2.0.0"/>
        <file name="README.md" category="doc" version="2.0.0"/>
        <file name="Source/Templates/arm/linker/stm32c53xxx_sram.sct" category="linkerScript" attr="config" condition="STM32C53xxx ARMCC" version="2.0.0"/>
        <file name="Source/Templates/arm/linker/stm32c542xc_sram.sct" category="linkerScript" attr="config" condition="STM32C542xC ARMCC" version="2.0.0"/>
        <file name="Source/Templates/arm/linker/stm32c55xxx_sram.sct" category="linkerScript" attr="config" condition="STM32C55xxx ARMCC" version="2.0.0"/>
        <file name="Source/Templates/arm/linker/stm32c562xe_sram.sct" category="linkerScript" attr="config" condition="STM32C562xE ARMCC" version="2.0.0"/>
        <file name="Source/Templates/arm/linker/stm32c59xxx_sram.sct" category="linkerScript" attr="config" condition="STM32C59xxx ARMCC" version="2.0.0"/>
        <file name="Source/Templates/arm/linker/stm32c5a3xg_sram.sct" category="linkerScript" attr="config" condition="STM32C5A3xG ARMCC" version="2.0.0"/>
        <file name="Source/Templates/gcc/linker/stm32c53xxx_sram.ld" category="linkerScript" attr="config" condition="STM32C53xxx GCC" version="2.0.0"/>
        <file name="Source/Templates/gcc/linker/stm32c542xc_sram.ld" category="linkerScript" attr="config" condition="STM32C542xC GCC" version="2.0.0"/>
        <file name="Source/Templates/gcc/linker/stm32c55xxx_sram.ld" category="linkerScript" attr="config" condition="STM32C55xxx GCC" version="2.0.0"/>
        <file name="Source/Templates/gcc/linker/stm32c562xe_sram.ld" category="linkerScript" attr="config" condition="STM32C562xE GCC" version="2.0.0"/>
        <file name="Source/Templates/gcc/linker/stm32c59xxx_sram.ld" category="linkerScript" attr="config" condition="STM32C59xxx GCC" version="2.0.0"/>
        <file name="Source/Templates/gcc/linker/stm32c5a3xg_sram.ld" category="linkerScript" attr="config" condition="STM32C5A3xG GCC" version="2.0.0"/>
        <file name="Source/Templates/iar/linker/stm32c53xxx_sram.icf" category="linkerScript" attr="config" condition="STM32C53xxx IAR" version="2.0.0"/>
        <file name="Source/Templates/iar/linker/stm32c542xc_sram.icf" category="linkerScript" attr="config" condition="STM32C542xC IAR" version="2.0.0"/>
        <file name="Source/Templates/iar/linker/stm32c55xxx_sram.icf" category="linkerScript" attr="config" condition="STM32C55xxx IAR" version="2.0.0"/>
        <file name="Source/Templates/iar/linker/stm32c562xe_sram.icf" category="linkerScript" attr="config" condition="STM32C562xE IAR" version="2.0.0"/>
        <file name="Source/Templates/iar/linker/stm32c59xxx_sram.icf" category="linkerScript" attr="config" condition="STM32C59xxx IAR" version="2.0.0"/>
        <file name="Source/Templates/iar/linker/stm32c5a3xg_sram.icf" category="linkerScript" attr="config" condition="STM32C5A3xG IAR" version="2.0.0"/>
        <file name="Source/Templates/system_stm32c5xx.c" category="source" attr="config" version="2.0.0"/>
        <file name="Source/startup_stm32c531xx.c" category="source" attr="config" condition="STM32C531" version="2.0.0"/>
        <file name="Source/startup_stm32c532xx.c" category="source" attr="config" condition="STM32C532" version="2.0.0"/>
        <file name="Source/startup_stm32c542xx.c" category="source" attr="config" condition="STM32C542" version="2.0.0"/>
        <file name="Source/startup_stm32c551xx.c" category="source" attr="config" condition="STM32C551" version="2.0.0"/>
        <file name="Source/startup_stm32c552xx.c" category="source" attr="config" condition="STM32C552" version="2.0.0"/>
        <file name="Source/startup_stm32c562xx.c" category="source" attr="config" condition="STM32C562" version="2.0.0"/>
        <file name="Source/startup_stm32c591xx.c" category="source" attr="config" condition="STM32C591" version="2.0.0"/>
        <file name="Source/startup_stm32c593xx.c" category="source" attr="config" condition="STM32C593" version="2.0.0"/>
        <file name="Source/startup_stm32c5a3xx.c" category="source" attr="config" condition="STM32C5A3" version="2.0.0"/>
      </files>
    </component>
  </components>
  <conditions>
    <condition id="STM32C5">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C5*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
