embassy-rs/stm32-data-sources/cubeprogdb2/stm32c5/STMicroelectronics.stm32c5xx_dfp.pdsc
    <condition id="STM32C531">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C531*"/>
    </condition>
    <condition id="STM32C532">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C532*"/>
    </condition>
    <condition id="STM32C53xxB ARMCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C53??B*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32C53xxB GCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C53??B*"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32C53xxB IAR">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C53??B*"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32C53xxC ARMCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C53??C*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32C53xxC GCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C53??C*"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32C53xxC IAR">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C53??C*"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32C53xxx ARMCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C53???*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32C53xxx GCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C53???*"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32C53xxx IAR">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C53???*"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32C542">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C542*"/>
    </condition>
    <condition id="STM32C542xC ARMCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C542?C*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32C542xC GCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C542?C*"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32C542xC IAR">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C542?C*"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32C551">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C551*"/>
    </condition>
    <condition id="STM32C552">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C552*"/>
    </condition>
    <condition id="STM32C55xxC ARMCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C55??C*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32C55xxC GCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C55??C*"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32C55xxC IAR">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C55??C*"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32C55xxE ARMCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C55??E*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32C55xxE GCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C55??E*"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32C55xxE IAR">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C55??E*"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32C55xxx ARMCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C55???*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32C55xxx GCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C55???*"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32C55xxx IAR">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C55???*"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32C562">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C562*"/>
    </condition>
    <condition id="STM32C562xE ARMCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C562?E*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32C562xE GCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C562?E*"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32C562xE IAR">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C562?E*"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32C591">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C591*"/>
    </condition>
    <condition id="STM32C593">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C593*"/>
    </condition>
    <condition id="STM32C59xxE ARMCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C59??E*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32C59xxE GCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C59??E*"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32C59xxE IAR">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C59??E*"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32C59xxG ARMCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C59??G*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32C59xxG GCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C59??G*"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32C59xxG IAR">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C59??G*"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32C59xxx ARMCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C59???*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32C59xxx GCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C59???*"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32C59xxx IAR">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C59???*"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32C5A3">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C5A3*"/>
    </condition>
    <condition id="STM32C5A3xG ARMCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C5A3?G*"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32C5A3xG GCC">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C5A3?G*"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32C5A3xG IAR">
      <require Dvendor="STMicroelectronics:13" Dname="STM32C5A3?G*"/>
      <require Tcompiler="IAR"/>
    </condition>
  </conditions>
</package>